Revit 2027 API
FieldDomainPointsByParameter Constructor
 Creates object from an array of one-dimensional point coordinates
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldDomainPointsByParameter(
	IList<double> points
)
Public Sub New (
	points As IList(Of Double)
)
public:
FieldDomainPointsByParameter(
	IList<double>^ points
)
new :
        points : IList<float> -> FieldDomainPointsByParameter
Parameters
points IList<Double>
 Array of one-dimensional point coordinates representing domain points (using raw parameters when on a curve)
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldDomainPointsByParameter Class
Autodesk.Revit.DB.Analysis Namespace